In [2]:
#Limpeza e tratamento de dados
import pandas as pd
import seaborn as srn
import statistics as sts

In [3]:
#importar dados
dataset = pd.read_csv("Churn.csv", sep=";")
#visualizar
dataset.head()

   X0   X1  X2        X3  X4  X4.1        X6  X7  X8  X9         X10  X11
0   1  619  RS  Feminino  42     2         0   1   1   1  10134888.0    1
1   2  608  SC  Feminino  41     1   8380786   1   0   1  11254258.0    0
2   3  502  RS  Feminino  42     8   1596608   3   1   0  11393157.0    1
3   4  699  RS  Feminino  39     1         0   2   0   0   9382663.0    0
4   5  850  SC  Feminino  43     2  12551082   1   1   1    790841.0    0

In [5]:
#tamanho do conjunto de dados

dataset.shape

(999, 12)

In [6]:
#primeiro vamos dar nomes as colunas vendo que as colunas não referenciam a algo com significado
dataset.columns = ["id", "Score", "Estado", "Genero", "Idade", "Patrimonio","Saldo","Produto","TemCartCredito","Ativo","Salario","Saiu"]

In [7]:
#Visualizar
dataset.head()

,id,Score,Estado,Genero,Idade,Patrimonio,Saldo,Produto,TemCartCredito,Ativo,Salario,Saiu
0,1,619,RS,Feminino,42,2,0,1,1,1,10134888.0,1
1,2,608,SC,Feminino,41,1,8380786,1,0,1,11254258.0,0
2,3,502,RS,Feminino,42,8,1596608,3,1,0,11393157.0,1
3,4,699,RS,Feminino,39,1,0,2,0,0,9382663.0,0
4,5,850,SC,Feminino,43,2,12551082,1,1,1,790841.0,0

In [8]:
#a primeira parte que fazemos é fazer uma análise exploratória dos dados para entendermos os problemas da base de dados
#para limpar e tratar dados você precisa entender as regras de negocio
#Outro problema são os valores NULL pois o modelos de machine learning geralmente não lidam bem com eles
#podemos resolver essa questão dos valores nullos utilizando técnicas de autopreeenchimento

# Análise exploratória Técnicas
#   -Gerando gráficos visuais
#   -E também alguns resumos estátisticos

#Primeiros passos para Fazer análise
#   Comessamos primeiramente pelos dados categoricos tendo como opções gráfico de barras ou de setor
#   Posteriormente Fazemos a a nálise dos dados numéricos com resumos estátisticos e podemos gerar um gráfico de histograma e um blockspot

In [9]:
#Exploração de dados CATEGORICOS
#Comessaremos a trabalhar com o dado categorico Estado, verificando a quantidade de ocorrencias de cada valor

agrupar = dataset.groupby(["Estado"]).size()
agrupar

Estado
PR    257
RP      1
RS    478
SC    258
SP      4
TD      1
dtype: int64